; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image3 - mode
	spectrograph5 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	infrared4 - mode
	spectrograph7 - mode
	spectrograph6 - mode
	spectrograph8 - mode
	spectrograph2 - mode
	Star2 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph5)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph7)
	(supports instrument1 spectrograph5)
	(supports instrument1 spectrograph6)
	(supports instrument1 spectrograph8)
	(calibration_target instrument1 Star2)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument3 infrared4)
	(supports instrument3 spectrograph1)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 image3)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 spectrograph6)
	(supports instrument5 spectrograph7)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
)
(:goal (and
	(pointing satellite1 Star2)
	(have_image Planet5 spectrograph0)
	(have_image Planet5 infrared4)
	(have_image Phenomenon6 infrared4)
	(have_image Planet7 spectrograph6)
	(have_image Planet7 spectrograph8)
	(have_image Planet7 spectrograph2)
	(have_image Star8 spectrograph2)
	(have_image Star8 spectrograph0)
	(have_image Star8 spectrograph5)
	(have_image Star9 spectrograph1)
	(have_image Star9 spectrograph6)
	(have_image Star9 spectrograph5)
	(have_image Phenomenon10 infrared4)
	(have_image Star11 spectrograph6)
))

)

; plan
1. (turn_to satellite1 groundstation1 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 15
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 15
3. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 0 of 15
4. (turn_to satellite1 planet7 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet7)
   goals met: 0 of 15
5. (take_image satellite1 planet7 instrument3 spectrograph2)
   added: (have_image planet7 spectrograph2)
   goals met: 1 of 15
6. (turn_to satellite1 planet5 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet5)
   goals met: 1 of 15
7. (take_image satellite1 planet5 instrument3 infrared4)
   added: (have_image planet5 infrared4)
   goals met: 2 of 15
8. (turn_to satellite1 phenomenon6 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon6)
   goals met: 2 of 15
9. (take_image satellite1 phenomenon6 instrument3 infrared4)
   added: (have_image phenomenon6 infrared4)
   goals met: 3 of 15
10. (turn_to satellite1 phenomenon10 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 15
11. (turn_to satellite0 groundstation0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 15
12. (take_image satellite1 phenomenon10 instrument3 infrared4)
   added: (have_image phenomenon10 infrared4)
   goals met: 4 of 15
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 15
14. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 4 of 15
15. (turn_to satellite0 planet5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet5)
   goals met: 4 of 15
16. (take_image satellite0 planet5 instrument0 spectrograph0)
   added: (have_image planet5 spectrograph0)
   goals met: 5 of 15
17. (turn_to satellite0 star8 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star8)
   goals met: 5 of 15
18. (take_image satellite0 star8 instrument0 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 6 of 15
19. (take_image satellite0 star8 instrument0 spectrograph5)
   added: (have_image star8 spectrograph5)
   goals met: 7 of 15
20. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 7 of 15
21. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 7 of 15
22. (turn_to satellite0 star2 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star2)
   goals met: 7 of 15
23. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 7 of 15
24. (turn_to satellite0 planet7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet7)
   goals met: 7 of 15
25. (take_image satellite0 planet7 instrument1 spectrograph6)
   added: (have_image planet7 spectrograph6)
   goals met: 8 of 15
26. (take_image satellite0 planet7 instrument1 spectrograph8)
   added: (have_image planet7 spectrograph8)
   goals met: 9 of 15
27. (turn_to satellite0 star11 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star11)
   goals met: 9 of 15
28. (take_image satellite0 star11 instrument1 spectrograph6)
   added: (have_image star11 spectrograph6)
   goals met: 10 of 15
29. (turn_to satellite0 star9 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star9)
   goals met: 10 of 15
30. (take_image satellite0 star9 instrument1 spectrograph5)
   added: (have_image star9 spectrograph5)
   goals met: 11 of 15
31. (take_image satellite0 star9 instrument1 spectrograph6)
   added: (have_image star9 spectrograph6)
   goals met: 12 of 15
32. (turn_to satellite1 star8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star8)
   goals met: 12 of 15
33. (take_image satellite1 star8 instrument3 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 13 of 15
34. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 13 of 15
35. (take_image satellite1 star9 instrument3 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 14 of 15
36. (turn_to satellite1 star2 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star2)
   goals met: 15 of 15
